---
kind: property
id: P:Autodesk.Revit.DB.ViewDisplayModel.SilhouetteEdgesGStyleId
source: html/51d10382-ff84-9fd2-c31e-7bf4ec9c1995.htm
---
# Autodesk.Revit.DB.ViewDisplayModel.SilhouetteEdgesGStyleId Property

Style ID for silhouette edges

## Syntax (C#)
```csharp
public ElementId SilhouetteEdgesGStyleId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null